app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)
    if @blog.save
---
INSERT INTO "blogs" ("title", "content") VALUES ($1, $2) RETURNING "id"  [["title", "hogehoge"], ["content", "jumbo"]]

  def update
    if @blog.update(blog_params)
---
UPDATE "blogs" SET "title" = $1, "content" = $2 WHERE "blogs"."id" = $3  [["title", "moromoro"], ["content", "miemie"], ["id", 9]]